---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn1
source: html/9eef63a1-02ef-2fe4-f45e-ef595dc55b22.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn1 Property

"Exterior Major Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesFrontDirn1 { get; }
```